tutorials/heatTransfer/chtMultiRegionFoam/coolingCylinder2D/constant/solid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cylinderHeat
{
    type            semiImplicitSource;
    selectionMode   all;
    volumeMode      specific;
    power           5e7;

    sources
    {
        e
        {
            explicit $power;
            implicit 0;
        }
    }
}

//************************************************************************** //
